Шаблоны/Request_1005.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:smev="http://smev.gosuslugi.ru/rev120315" xmlns:pfr="http://pfr.skmv.rstyle.com" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns="http://sum-soc-help.skmv.rstyle.com">
  <soap:Body wsu:Id="body">
    <Transport>
      <smev:Message>
        <smev:Sender>
          <smev:Code>#SND_CODE#</smev:Code>
          <smev:Name>#SND_NAME#</smev:Name>
        </smev:Sender>
        <smev:Recipient>
          <smev:Code>#SND_CODE#</smev:Code>
          <smev:Name>#SND_NAME#</smev:Name>
        </smev:Recipient>
        <smev:Originator>
          <smev:Code>#SND_CODE#</smev:Code>
          <smev:Name>#SND_NAME#</smev:Name>
        </smev:Originator>
        <smev:ServiceName>TestMnemonic</smev:ServiceName>
        <smev:TypeCode>GSRV</smev:TypeCode>
        <smev:Status>REQUEST</smev:Status>
        <smev:Date>#DATE#</smev:Date>
        <smev:ExchangeType>2</smev:ExchangeType>
        <smev:TestMsg>Test</smev:TestMsg>
        <smev:OKTMO>#OKTMO#</smev:OKTMO>
      </smev:Message>
      <smev:MessageData>
        <smev:AppData>
          <Transport>
            <Citizen>
              <LastName>#LASTNAME#</LastName>
              <FirstName>#FIRSTNAME#</FirstName>
              <MiddleName>#MIDDLENAME#</MiddleName>
              <BirthDate>#BIRTHDAY#</BirthDate>
            </Citizen>
            <IdentityDocument>
              <DocumentType>#DOCUMENTTYPE#</DocumentType>
              <Series>#SERIES#</Series>
              <Number>#NUMBER#</Number>
            </IdentityDocument>
          </Transport>
        </smev:AppData>
      </smev:MessageData>
    </Transport>
  </soap:Body>
</soap:Envelope>
